app/Http/Controllers/Front/HomeController.php

select `name`, `industry_slug`, `total_jobs` from `industries` order by IF(`total_jobs` >= 10, 0, 1), name asc
select `name`, `city_slug`, `total_jobs` from `cities` order by IF(`total_jobs` >= 5, 0, 1), name asc limit 44
select `id`, `company_name`, `company_slug`, `total_jobs`, `company_logo` from `recruiters` where ( company_name IS NOT NULL ) AND (total_jobs != 0) AND (country_signed = 'local') and `is_blocked` = 0 group by `company_name` order by `company_name` asc limit 44
---
    public function index(){

        $industries = Industry::select("name","industry_slug","total_jobs")->orderByRaw('IF(`total_jobs` >= 10, 0, 1), name asc')->get();

//        dd($_SERVER['REMOTE_ADDR'])

        if( Request::ip() == '172.69.39.11' ){
//            $industries = Industry::cursor();
//            dd($industries->first());
        }

//        $industries = $industries->get();
//        , name asc
        $cities = City::orderByRaw('IF(`total_jobs` >= 5, 0, 1), name asc')->limit(44)->select("name","city_slug","total_jobs")->get();
        $companies = Recruiter::WhereRaw("( company_name IS NOT NULL ) AND (total_jobs != 0) AND (country_signed = '".getsubDomain()."')")->where("is_blocked" , 0)->orderBy("company_name", 'asc')->groupBy("company_name")->limit(44)->select("id","company_name","company_slug","total_jobs","company_logo")->get();