app/Http/Controllers/Seeker/SeekerAuthController.php

update `seekers` set `phone` = '{\"phone\":\"03045287712\"}', `expected_salary` = '10000', `available_job_type` = 'temporary', `cv_resume` = '1692131658d5649577d944f7873e601fd03f37502810-Capture.PNG1.PNG.PNG', `reg_step` = 0, `confirm_email_random_id` = 'FGEc2oN70uYrZ054Of4I3CIGpSPYGjKMmXh', `country_signed` = 'local', `seekers`.`updated_at` = '2023-08-15 20:34:18' where `id` = 15
---
            $data['confirm_email_random_id'] = Str::random(35);
            $data['phone'] = json_encode($phone);

            $seeker->update($data);