app/Listeners/JobAlertCreating.php

    public function handle($event)
    {
        $alert = $event->job_alert;


        $stats = WebStat::first();
        if(!$stats){
            $stats = new WebStat();
        }
        $stats->total_alerts = $stats->total_alerts +1;
        $stats->save();
---
update `web_stats` set `total_alerts` = 885, `web_stats`.`updated_at` = '2023-08-15 20:58:39' where `id` = 1