app/Seeker.php

update `seekers` set `profile_complete` = 40, `seekers`.`updated_at` = '2023-08-15 20:58:52' where `id` = 17
---
    public function profile_strength($inputs=FALSE){

        $strength = 0;
        $missing_inputs = array();

        if( $this->cv_resume != '' ){

            $increment = 10;
            $fields = array("first_name","email","phone","dob","avatar","expected_salary","available_job_type","cv_resume","gender", "city");


            foreach ($fields as $field){
                if($this->$field != ''){
                    $strength = $strength + $increment;
                }else{
                    array_push($missing_inputs, $field);
                }
            }

            $strength = round($strength);
            if($strength>100){
                $strength = 100;
            }

            $this->profile_complete = $strength;
            $this->save();

update `seekers` set `profile_complete` = 8, `seekers`.`updated_at` = '2023-08-15 20:58:39' where `id` = 17
---


            $this->profile_complete = $strength;
            $this->save();