app/Exceptions/Handler.php

    public function report(Exception $exception)
    {
//        dd( $exception );
//        if ($exception->getStatusCode() === 500 ) {
            $getActivity = ActivityLogs::where("activity_on", request()->fullUrl())->first();
            if( !$getActivity ){
                $create_activity = new ActivityLogs();
                $create_activity->log_type = 'error_app_running';
                $create_activity->activity_on = request()->fullUrl();
                $create_activity->message = $exception->getMessage(). ' in file '.$exception->getFile().' on Line '.$exception->getLine();
                $create_activity->save();
---
select * from `activity_logs` where `activity_on` = 'http://127.0.0.1:8000' limit 1
insert into `activity_logs` (`log_type`, `activity_on`, `message`, `updated_at`, `created_at`) values ('error_app_running', 'http://127.0.0.1:8000/seeker/login', 'SQLSTATE[HY000] [1045] Access denied for user \'saqlain_fratres_accounts\'@\'localhost\' (using password: YES) (SQL: select * from `seekers` where `email` = waleedulhassan6@gmail.com and `is_blocked` = 0 and `is_social_login` = 0 limit 1) in file D:\all-Fratres-code-main\all-Fratres-code-main\vendor\laravel\framework\src\Illuminate\Database\Connection.php on Line 664', '2023-08-15 19:00:37', '2023-08-15 19:00:37')

    public function render($request, Exception $exception)
    {
        $getActivity = ActivityLogs::where("activity_on", request()->fullUrl())->first();
---
select * from `activity_logs` where `activity_on` = 'http://127.0.0.1:8000' limit 1